while True:
    print ("")
    print ("км / сағ м / с-қа ауыстыру                       (1-di bas)")
    print ("м / с-ны км / сағ-қа ауыстыру                    (2-ni bas)")
    print ("Уақыт пен қашықтық бойынша жылдамдықты анықтаy   (3-ti bas)")
    print ("Жылдамдық пен қашықтық бойынша уақытты анықтаңыз (4-ti bas)")
    print ("Қашықтықты уақыт пен жылдамдық бойынша анықтаңыз (5-ti bas)")
    print ("")

    x = int(input(("Әрекетті таңдаңыз: ")))
    
    if x == 1:
        y = int(input(("Жылдамдығы км / сағ: ")))
        z = round(y * 0.2778, 1)
        print(z, "м/с")
        
    if x == 2:
        y = int(input(("Жылдамдығы м/с: ")))
        z = y * 3,6
        print(z, "км/ч")
        
    if x == 3:
        s = int(input(("Арақашықтық километрмен: ")))
        t = int(input(("Саяхат уақыты сағатпен: ")))
        v = round(s/t, 1)
        print("Саяхат жылдамдығы", v, " км/ч")
        
    if x == 4:
        v = int(input(("Жылдамдығы км / сағ: ")))
        s = int(input(("Арақашықтық километрмен: ")))
        t = round (s/v, 2)
        m = round(60*t, 1)
        print("Саяхат уақыты", t, " сағат немесе ", m, "минут")
        
    if x == 5:
        v = int(input(("Жылдамдығы км / сағ: ")))
        t = int(input(("Саяхат уақыты сағатпен: ")))
        s = v*t
        print("Арақашықтық", s, " километр")
    
            
